{"sections":{"1642741869155e9d29":{"type":"custom-html","settings":{"subheading":"","title":"","html":"<h1>FAQ<\/h1>"}},"main":{"type":"main-faq","blocks":{"86159911-c8ac-4222-87bb-16083a325a4a":{"type":"separator","settings":{"title":"ORDERS"}},"74658f54-1987-44e6-9cc0-c81da8aa6c1a":{"type":"question","settings":{"title":"How long does it take to confirm and ship out my order?","answer":"<p>You will receive another email from us once your order has been shipped, along with Australia Post tracking information.<\/p>","title_2":"How can I track my order?","answer_2":"<p>Once your order is shipped you will receive a confirmation email from <a href=\"https:\/\/boniik.com.au\/\" title=\"BONIIK\">boniik.com.au<\/a> which will include your tracking number. You can track the progress of your order through Australia Post with this tracking number from the order confirmation email.<\/p>","title_3":"Do you ship to PO Boxes or Parcel Lockers?","answer_3":"<p>Yes we do! Simply put your designated PO Box or Parcel Locker in the ‘Shipping Address’ section.<\/p>","title_4":"What happens if I entered the wrong address?","answer_4":"<p>Please contact our Customer Service Team as soon as possible by sending an email to <br\/><a href=\"mailto:customerservice@boniik.com.au\" title=\"BONIIK Customer Service Email\">customerservice@boniik.com.au<\/a><br\/>We are able to make changes to delivery addresses as long as you contact us BEFORE your order is shipped out.<br\/><br\/>In the event that you wish to make changes to your address after your order has been shipped out, please also contact us at <a href=\"mailto:customerservice@boniik.com.au\">customerservice@boniik.com.au<\/a><br\/>so that we can endeavor to find a solution for you.<br\/><br\/>However, once the parcel has left our warehouse, it will be difficult to redirect the parcel to a different address. As such, kindly recheck and confirm that the right address has been entered before placing the order.<\/p><p><br\/>Orders that are returned to us due to address errors and need to be sent back to the intended recipient will incur an administrative fee of $10.00.<\/p>","title_5":"Can I ship to multiple addresses?","answer_5":"<p>Yes! You can do this by creating separate orders, each with their own delivery address and name of recipient.<\/p>","title_6":"What if I receive the wrong item?","answer_6":"<p>If you have received an item that you did not order or have any missing items from your order, please take a photo of the items you have received and send an email to <br\/><a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><br\/>with your name, order number and details of items you received instead or did not receive.<\/p>","title_7":"What about faulty\/defective items?","answer_7":"<p>If you have received an item that is faulty or defective (eg broken pump, missing spring, etc), please send us an email at <br\/><a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a> with the details and photos.<\/p>"}},"c4a6af1d-f780-4e75-bc24-ea6563bee564":{"type":"question","settings":{"title":"What about change of mind?","answer":"<p>Don’t worry! We are happy to provide you with exchange or store credit for items you purchased from us. Please note, the products must still be in their original, unused and saleable condition. Our team will assess each individual product returned before providing you with exchange or store credit. Simply send us an email at <br\/><a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><br\/>within 30 days of your order date for online purchase, and 15 days from your date of purchase for in-store purchases.<br\/><br\/>SALE & PROMOTIONAL items <strong>DO NOT <\/strong>fall under our returns policy with change of mind, due to the safety and hygiene of our customers.<\/p><p>For the safety and hygiene of our customers we <strong>DO NOT ACCEPT <\/strong>returns or exchanges for products including, but not limited to false eyelashes, nail art, accessories, beauty tools.<br\/><br\/>If you have changed your mind about your purchase BEFORE your order is dispatched, you may be eligible for a full refund. Please email us as soon as possible at <br\/><a href=\"mailto:customerservice@boniik.com.au\">customerservice@boniik.com.au<\/a><\/p>","title_2":"What happens if an item I ordered is out of stock?","answer_2":"<p>We aim to always have your favorite products in stock. However, from time to time we may sell out. In the event that your item is out of stock, we will send you a notification email and provide you with options for replacement products or a refund of the out of stock item.<br\/><br\/>If you wish to be notified when the products are back in stock, simply press the ‘Notify Me When Available’ button located in the product page. Once you do this, you will be the first to know when the item is back in stock!<\/p>","title_3":"What about lost\/damaged goods?","answer_3":"<p>If your order is lost or damaged during transit, please send us an email at <br\/><a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au.<\/a> <\/p><p>Please understand that once the product is dispatched, we have no control over the parcel as AUPOST is the one that needs to take the responsibility. However, we will always do our best by extending our customer service, to make sure our customers are not in a disadvantaged position from any of these situations. <\/p>","title_4":"How do I use coupon codes?","answer_4":"<p>Coupon codes must be applied at checkout. Please note, only ONE coupon code will be valid per transaction.<\/p><p>For more information, please refer to our <a href=\"https:\/\/boniik.com.au\/pages\/footer-terms-of-use\" target=\"_blank\" title=\"BONIIK Terms and Conditions\">terms and conditions here<\/a>.<\/p>","title_5":"What are the T&Cs of your promotions\/sale & gift cards?","answer_5":"<p>1. Valid for members only. Sign up <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"Account Sign Up\">here<\/a> to become our member!<br\/>2. Promotion\/Sale items purchased during the sale are not exchangeable or refundable.<br\/>3. No loyalty points, credit note, or promotional voucher can be used during this period.<br\/>4. Gift cards can be purchased with full price only - Gift cards can be used for promotional and sale items.<br\/>5. No loyalty points will be earned with any promotional items or sales<br\/>6. Not in conjunction with other offers or promotions.<\/p>","title_6":"","answer_6":"","title_7":"","answer_7":""}},"1867ad83-ad40-420d-a377-3d7f3e812d66":{"type":"separator","settings":{"title":"PAYMENT"}},"16470416-24b0-40ad-81a1-9dd452f3c158":{"type":"question","settings":{"title":"What are the payment methods available at BONIIK","answer":"<p>You can choose any of the following payment methods at checkout to complete your order:<br\/><br\/>•\tCredit Card (Visa\/Master Card)<br\/>•\tPayPal<br\/>•\tAfterpay<br\/><br\/>If you are placing a phone order with us, an invoice will be sent to your nominated email address and you can select from any of the above payment methods to complete your order.<\/p>","title_2":"Is it safe and secure to shop at BONIIK?","answer_2":"<p>At BONIIK, your security while shopping with us online is our top priority.<br\/><br\/>As such, we have taken all reasonable measures to ensure a secure, streamlined online purchase environment so that all your personal and payment details are kept safe at all times.<br\/><br\/>Please see our Privacy Policy for more details<\/p>","title_3":"I am experiencing problems ordering through my mobile device","answer_3":"<p>BONIIK is compatible on most mobile devices and browsers. We suggest restarting your browser, clearing cache and browsing data before logging back into <a href=\"https:\/\/boniik.com.au\" title=\"BONIIK \">https:\/\/boniik.com.au<\/a><br\/><br\/>If you are still facing problems, please send a screenshot of the error to <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au <\/a>and we will be able to assist you further.<\/p>","title_4":"I am experiencing issues with a Coupon Code \/ Gift Card","answer_4":"<p>Please check if:<br\/>•\tVoucher or coupon code has expired<br\/>•\tVoucher or coupon code is for one time use only<br\/>•\tVoucher or coupon code is not valid for sale items<br\/>•\tOnly 1 voucher or coupon code valid per order<br\/>•\tYou are using the email address in which the voucher or coupon code is linked to<br\/>•\tYou have used a non-participating credit card or payment method for the coupon discount<br\/>•\tVoucher or coupon is not valid with any other promotions, discounts or loyalty rewards redemption<\/p><p><\/p><p>If you are still experiencing problems, please send us an<br\/>email at <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><\/p>","title_5":"","answer_5":"","title_6":"","answer_6":"","title_7":"","answer_7":""}},"c4089c0c-c780-48b8-8f15-db17cf48035a":{"type":"separator","settings":{"title":"DELIVERY"}},"afdbe837-64e4-4342-b350-65010eebfe1e":{"type":"question","settings":{"title":"How long does shipping take?","answer":"<p>Please refer to our <a href=\"https:\/\/boniik.com.au\/pages\/footer-shipping\" title=\"Shipping Policy \">Shipping Policy<\/a> page for details relating to shipping costs.<\/p>","title_2":"How much does it cost to ship to my address?","answer_2":"<p>Please refer to our <a href=\"https:\/\/boniik.com.au\/pages\/footer-shipping\" title=\"Shipping Policy\">Shipping Policy <\/a>page for details relating to shipping costs.<\/p>","title_3":"Do you offer international shipping outside Australia?","answer_3":"<p>Yes we offer international shipping. Please refer to our <a href=\"https:\/\/boniik.com.au\/pages\/footer-shipping\" title=\"Shipping Policy\">Shipping Policy<\/a> page for details relating to international shipping costs.<\/p>","title_4":"Is Click and Collect available?","answer_4":"<p>Yes, <a href=\"https:\/\/boniik.com.au\/pages\/boniik-click-collect\" target=\"_blank\" title=\"BONIIK Click and Collect | Best Korean Beauty Store in Australia\">click and collect<\/a> is available! Your order will usually be ready within 24 hours after placing an order (subject to item availability). Once your order is ready for collection, we will send you a ‘Ready for Collection’ email to let you know when to head to our store to collect it! Please note that you will need to wait for our Ready for Collection email before visiting us to avoid disappointment.<\/p><p><br\/>Please ensure that you have a copy of your ‘Ready for Collection’ email or in the form of a copy on your mobile, as well as Photo Identification. BONIIK staff members have the right to refuse handing your items to you if you do not have proof of identification with you.<\/p>","title_5":"","answer_5":"","title_6":"","answer_6":"","title_7":"","answer_7":""}},"c16886c8-9bd3-4aae-9464-d52341e8901f":{"type":"separator","settings":{"title":"ACCOUNT"}},"66ff1bda-8e8e-461a-b243-523b9f86e1f7":{"type":"question","settings":{"title":"I cannot log into my account online","answer":"<p>If you have forgotten your password, please press the ‘Forgot Password?’ button to reset your account password. You will then be asked to enter your name and the email address used to set up your account, and a link to reset your password will be sent to you. If you still cannot reset your password, please send an email to <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><\/p><p><\/p><p>If you know you have an OFFLINE or STORE membership with us but cannot login, please ‘Create an Account’ online. Don’t worry, your accumulated membership points\/credits will be transferred in the system.<\/p>","title_2":"I am having issues with my loyalty points","answer_2":"<p>Please refer to our BONIIK Beauties Loyalty Program FAQ (below) for more information. Alternatively, please send us an email at <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><\/p>","title_3":"How do I arrange if I no longer wish to receive communications?","answer_3":"<p>You may unsubscribe from our emails by pressing the ‘Unsubscribe’ button found at the bottom of the e-newsletter.<\/p><p>If you are unable to unsubscribe, please ensure that you are<br\/>unsubscribing from the email address that is linked to your account with us. Alternatively, please send us an email at <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au<\/a><\/p>","title_4":"","answer_4":"","title_5":"","answer_5":"","title_6":"","answer_6":"","title_7":"","answer_7":""}},"d3eaa8e7-eb1f-49b2-8d9d-4d4495eb2519":{"type":"separator","settings":{"title":"BONIIK BEAUTIES LOYALTY"}},"888c5ca8-26b5-4c00-b93a-b98dd3633b8f":{"type":"question","settings":{"title":"What is ‘BONIIK Beauties’?","answer":"<p><a href=\"https:\/\/boniik.com.au\/blogs\/offers\/boniik-beauties-loyalty-program\" target=\"_blank\" title=\"BONIIK Beauties Loyalty Program | Best Korean Beauty, Skincare and Makeup Store in Australia\">BONIIK Beauties<\/a> is our loyalty program where you get rewarded whenever you shop your favourite Korean beauty products with us! You are also able to access different perks and benefits of becoming part of this program such as early access to special promotions, new product launches, sneak peeks and many more!<\/p>","title_2":"Is the BONIIK Beauties membership free?","answer_2":"<p>Yes! BONIIK Beauties is open to all our customers! Simply sign up here: <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"BONIIK Account Register \">https:\/\/boniik.com.au\/account\/register<\/a>.<\/p><p><\/p><p>For customers who signed up in store, you will need to create an account using the same email address you registered with us In-Store to sync your account here: <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"Customer Service Register\">https:\/\/boniik.com.au\/account\/register<\/a>.<br\/><\/p>","title_3":"I have signed up at BONIIK In-store. Do I need to sign up again Online?","answer_3":"<p>Yes. For customers who signed up in store, you will need to <strong>register<br\/>a new account<\/strong> online using the same email address you registered with us<br\/>In-Store to sync your account. You can register online here: <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"BONIIK Account Registry \">https:\/\/boniik.com.au\/account\/register<\/a>.<\/p><p><\/p><p>Once you have logged in, you will be able to see your points from your loyalty dashboard.<\/p>","title_4":"I have signed up BONIIK Online only. Do I need to sign up again In-Store?","answer_4":"<p>No. Once you have created the account online, you do not need to sign up again In-store. <\/p>","title_5":"Where have my In-store points gone?","answer_5":"<p>We have now synced our in-store and online points! Any previous loyalty points that you accumulated when shopping in-store has been converted to match our new rewards points.<\/p><p><\/p><p>Eg: If you have $5 loyalty amount, you now have 250 points in your account.<\/p><p>$5 x 50 points= 250 points<\/p>","title_6":"They can't find my account In-store. I know I have shopped with you. Where are my points?","answer_6":"<p>Please email us with the following details with <\/p><p>Email title: MY ACCOUNT IS MISSING<br\/>First name:<br\/>Last name:<br\/>Email Address:<br\/>Phone Number:<\/p><p><\/p><p>to <strong>customerservice@boniik.com.au<\/strong><\/p><p><\/p><p>We will try our best to investigate what happened to your account.<\/p>","title_7":"How can I earn points?","answer_7":"<p>BONIIK Beauties allow you to earn 1 point for every $1 spent on <strong>full-priced items<\/strong>. Sale and promotional items will not accumulate points.<br\/><br\/>As you move up the tiers, you will be able to earn points faster with every purchase.<br\/>For every $1 spent, you can get:<br\/><br\/>-\tBronze: 1 point<br\/>-\tSilver: 1.5 points<br\/>-\tGold: 2 points<\/p><p>You can also access all other rewards such as our birthday, promotions and sales.<\/p>"}},"6b3796be-64af-4dc5-ac2e-ea9a6d5b5d4a":{"type":"question","settings":{"title":"How do I spend my points?","answer":"<p>Once you have reached a minimum of 250 points, you will be able to redeem your points <strong>in-stores<\/strong> or <strong>online<\/strong>.<\/p><p>250 Points = $5 off<br\/>400 Points = $10 off<br\/>700 Points = $20 off<\/p><p>*Points cannot be used in conjunction with any other offers or promotions.<\/p>","title_2":"Do my points expire?","answer_2":"<p>Yes. Your points will expire 365 days after they are earned. You will receive an email from BONIIK one month before your points expire as a reminder for you to spend your points.<\/p>","title_3":"Do my coupon codes expire?","answer_3":"<p>Yes. Your coupon code will expire 365 days after they are issued.<\/p>","title_4":"What are the different BONIIK Beauties tiers?","answer_4":"<p>BONIIK Beauty tiers are based on your annual spending in Australian Dollars.<br\/><br\/>•\tBronze: $0-$399.99<br\/>•\tSilver: $400-$1499.99<br\/>•\tGold: $1500 and above<br\/><br\/>You will automatically move up a tier when your total annual spend reaches the minimum requirement. Plus, you will be able to redeem a special one-time 15% off code for new Silver members and 20% off code for new Gold members.<\/p>","title_5":"How do I check which tier I am in?","answer_5":"<p>You will only be able to check your tier <strong>online <\/strong>in the Rewards dashboard when you sign in online.<\/p><p><br\/>For customers who signed up in store, you will need to <strong>register<br\/>a new account<\/strong> online using the same email address you registered with us<br\/>In-Store to sync your account and view your tier. You can register online here: <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"BONIIK Account Registry \">https:\/\/boniik.com.au\/account\/register<\/a>.<\/p>","title_6":"How long will it take to see my points update?","answer_6":"<p>Your points should be updated almost immediately. If not, kindly wait for 24 hours. If it is still not showing after 24 hours, please send an email to <a href=\"mailto:customservice@boniik.com.au\" title=\"Customer Service Email\">customservice@boniik.com.au<\/a> and we will be able to provide you with assistance.<\/p>","title_7":"I accidentally checked out and made a purchase without signing into BONIIK Beauties, what should I do?","answer_7":"<p>Please send an email to <a href=\"mailto:customerservice@boniik.com.au\" title=\"Customer Service Email\">customerservice@boniik.com.au <\/a>with your name, order number and best contact details for us to look into the issue for you.<\/p>"}},"da81a497-4731-42ba-ad9f-8c4a14b1ad5c":{"type":"question","settings":{"title":"How many times can the Welcome Gift coupon be used?","answer":"<p>This gift is only received once you reach a tier. It can only be used once on full priced items.<\/p>","title_2":"What are the T&Cs of BONIIK Beauties?","answer_2":"<p>Please refer to <a href=\"https:\/\/boniik.com.au\/pages\/footer-terms-of-use\" target=\"_blank\" title=\"BONIIK Terms and Conditions\">BONIIK Beauties Terms and Conditions<\/a> here.<\/p>","title_3":"How can I update my birthday?","answer_3":"<p>You can update your birthday details here: <a href=\"https:\/\/boniik.com.au\/pages\/update-your-birthday\" title=\"BONIIK Update Your Birthday For A Gift\">https:\/\/boniik.com.au\/pages\/update-your-birthday<\/a><\/p><p><br\/>*Birthday registration needs to be done at least 2 weeks before actual birthday to receive a gift.<\/p>","title_4":"How can I get a Review Discount?","answer_4":"<p><strong>In-store: <\/strong>You will receive a review request email 7 days after you have made a purchase in store<\/p><p><strong>Online:<\/strong> You will receive your review request email 7 days after your order has been shipped.<\/p><p><\/p><p>Once you leave a review via your email, a coupon code will be sent to your email.<\/p>","title_5":"How do I Refer a Friend?","answer_5":"<p>You can do this once you have logged into your account online by going to the <\/p><p>Rewards dashboard -&gt; Earn Points.<\/p><p><br\/>For customers who signed up in store, you will need to create an account using the same email address you registered with us In-Store in order to refer a friend: <a href=\"https:\/\/boniik.com.au\/account\/register\" title=\"BONIIK Account Registry\">https:\/\/boniik.com.au\/account\/register<\/a>.<br\/><\/p><p>Your Friend will get 5% when you refer them and when they sign up. Once they have made their purchase, you will receive a 10% coupon code in your dashboard.<br\/><\/p>","title_6":"","answer_6":"","title_7":"","answer_7":""}},"be339169-dbe9-448c-84c0-8523c1da0c66":{"type":"separator","settings":{"title":"PRODUCTS"}},"e89c838c-0f78-48a4-8c9d-6bbfe23c50d1":{"type":"question","settings":{"title":"Are your products pregnancy-safe?","answer":"<p>While the amount of product absorbed into the skin can be considered negligible, we urge that you speak to your doctor or dermatologist if you have any concerns.<\/p>","title_2":"","answer_2":"","title_3":"","answer_3":"","title_4":"","answer_4":"","title_5":"","answer_5":"","title_6":"","answer_6":"","title_7":"","answer_7":""}}},"block_order":["86159911-c8ac-4222-87bb-16083a325a4a","74658f54-1987-44e6-9cc0-c81da8aa6c1a","c4a6af1d-f780-4e75-bc24-ea6563bee564","1867ad83-ad40-420d-a377-3d7f3e812d66","16470416-24b0-40ad-81a1-9dd452f3c158","c4089c0c-c780-48b8-8f15-db17cf48035a","afdbe837-64e4-4342-b350-65010eebfe1e","c16886c8-9bd3-4aae-9464-d52341e8901f","66ff1bda-8e8e-461a-b243-523b9f86e1f7","d3eaa8e7-eb1f-49b2-8d9d-4d4495eb2519","888c5ca8-26b5-4c00-b93a-b98dd3633b8f","6b3796be-64af-4dc5-ac2e-ea9a6d5b5d4a","da81a497-4731-42ba-ad9f-8c4a14b1ad5c","be339169-dbe9-448c-84c0-8523c1da0c66","e89c838c-0f78-48a4-8c9d-6bbfe23c50d1"],"settings":{}}},"order":["1642741869155e9d29","main"]}